<template>
  <div class="text">
    <p>
      {{ message }}
    </p>
    <app-button color="danger" @click="$emit('removeBlockResume')">
      Удалить
    </app-button>
  </div>
</template>

<script>
import AppButton from './AppButton.vue'

export default {
  emits: ['removeBlockResume'],
  props: ['message'],
  components: {
    AppButton,
  },
}
</script>

<style scoped>
.text {
  display: flex;
  justify-content: space-between;
  align-items: center;
}

p {
  flex-basis: 75%;
}

</style>

// главный герой американского мультсериала «Рик и Морти», гениальный учёный, //
изобретатель, атеист (хотя в некоторых сериях он даже молится Богу, однако, //
каждый раз после чудесного спасения ссылается на удачу и вновь отвергает его //
существование), алкоголик, социопат, дедушка Морти. На момент начала третьего //
сезона ему 70 лет[1]. Рик боится пиратов, а его главной слабостью является некий
// - "Санчезиум". Исходя из того, что существует неограниченное количество //
вселенных, существует неограниченное количество Риков, герой сериала //
предположительно принадлежит к измерению С-137. В серии комикcов Рик относится к
// измерению C-132, а в игре «Pocket Mortys» — к измерению C-123[2]. Прототипом
// Рика Санчеза является Эмметт Браун, герой кинотрилогии «Назад в будущее»[3].
